//
//  main.swift
//  Programmers_SWIFT
//
//  Created by 최예주 on 2022/08/20.
//

import Foundation

// MARK: Level 1
//직사각형별찍기()
//print(행렬의덧셈([[1,2],[2,3]], [[3,4],[5,6]]))
//print(핸드폰번호가리기("01012345678"))
//print(하샤드수(10))
//print(평균구하기([1,2,3,4]))
//print(콜라츠추측(6))
//print(최대공약수와최소공배수(3, 12))
//print(짝수와홀수(3))
//print(제일작은수제거하기([10,34,1,-1,3]))
//print(정수제곱근판별(3))
//print(정수내림차순으로배치하기(118372))
//print(자연수뒤집어배열로만들기(12345))
//print(자릿수더하기(987))
print(이상한문자만들기("aa  aaaaaa aa"))
